In [3]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame({'A': [1,2,np.nan],
                  'B': [5,np.nan,np.nan],
                  'C': [1,2,3]})

In [7]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## Excluir NaN

In [10]:
df.dropna()

     A    B  C
0  1.0  5.0  1

## corte nas linhas (Todas as linhas que tiver NaN)

In [23]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

## corte nas colunas (Todas as colunas que tiver NaN)

In [14]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

## Trocar NaN por alguma coisa

In [28]:
df.fillna("conteúdo")

          A         B  C
0       1.0       5.0  1
1       2.0  conteúdo  2
2  conteúdo  conteúdo  3

In [30]:
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3